In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve']}
table = pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e'])
table

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiki
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

### 映射

In [3]:
mapping = {'Tokyo'   : '東京', 
           'Hokkaido': '北海道',
           'Osaka'   : '大阪',
           'Kyoto'   :'京都'}
table['中文'] = table['City'].map(mapping)

table

    ID      City  Birth_year     Name   中文
a  100     Tokyo        1990  Hiroshi   東京
b  101     Osaka        1989    Akiki   大阪
c  102     Kyoto        1992     Yuki   京都
d  103  Hokkaido        1997   Satoru  北海道
e  104     Tokyo        1982    Steve   東京